#pragma once
#include"define.h"
#include <string>

#define ENEMY_MAX_RANK 10 //敵の最大ランク
#define ENEMY_PER_RANK 3 //ランク当たりの敵の数

class EnemyManager
{
private:

    int enemy_image[ENEMY_PER_RANK][ENEMY_MAX_RANK];

    CHARACTER_DATA enemy_data[ENEMY_PER_RANK][ENEMY_MAX_RANK] =
    {
        {
            {"ヒレピラニア", 30, 30, 30,30, 25, 25, 10},
            {"スライム", 30, 30,30, 30, 25, 25, 10},
            {"ポイズンワーム", 30,30,30, 30, 25, 25, 10},
            {"ゾンビイヌ", 30, 30,30,30, 25, 25, 10},
            {"ひとくいばな", 30, 30,30,30, 25, 25, 10},
            {"やみのきし", 30, 30,30,30, 25, 25, 10},
            {"さつじんき", 30, 30,30,30, 25, 25, 10},
            {"てつのまもり", 30, 30, 30,30, 25, 25, 10},
            {"シークイーン", 30, 30, 30,30, 25, 25, 10},
            {"あくのそっきん", 30, 30,30,30, 25, 25, 10}
        },
        {
            {"タードアーチャー", 30, 30,30,30, 25, 25, 10},
            {"ハニーワスプ", 30, 30, 30,30,25, 25, 10},
            {"リザードロプス", 30, 30,30,30, 25, 25, 10},
            {"ゆうれい", 30, 30,30,30, 25, 25, 10},
            {"やみのへいし", 30, 30,30,30, 25, 25, 10},
            {"げんしのかいぶつ", 30,30,30, 30, 25, 25, 10},
            {"ケルベロス", 30, 30,30,30, 25, 25, 10},
            {"シャドードレイク", 30,30,30, 30, 25, 25, 10},
            {"じゃしんかん", 30, 30, 30,30,25, 25, 10},
            {"あくのこんげん", 30, 30, 30,30,25, 25, 10}
        },
        {
            {"な", 30, 30,30,30, 25, 25, 10},
            {"ゴブリン", 30, 30,30,30, 25, 25, 10},
            {"まほうつかい", 30, 30,30,30, 25, 25, 10},
            {"ね", 30, 30,30,30, 25, 25, 10},
            {"の", 30, 30,30,30, 25, 25, 10},
            {"は", 30, 30,30,30, 25, 25, 10},
            {"ひ", 30, 30,30,30, 25, 25, 10},
            {"ふ", 30, 30,30,30, 25, 25, 10},
            {"へ", 30, 30, 30,30,25, 25, 10},
            {"あ", 30, 30,30,30, 25, 25, 10}
        }
    };

public:

    EnemyManager();
    ~EnemyManager();

    CHARACTER_DATA GetEnemyData(int encount_enemy_rank)const;

};