#pragma once
#include"define.h"
#include <string>

#define ENEMY_MAX_RANK 10 //敵の最大ランク
#define ENEMY_PER_RANK 3 //ランク当たりの敵の数

class EnemyManager
{
private:

    int enemy_image[ENEMY_PER_RANK][ENEMY_MAX_RANK];

    CHARACTER_DATA enemy_data[ENEMY_PER_RANK][ENEMY_MAX_RANK] =
    {
        {
            {"ヒレピラニア", 15, 15, 15,15, 15, 15, 15},
            {"スライム", 15, 15,15, 15, 20, 20, 15},
            {"ポイズンワーム",  15, 15,15, 15, 20, 20, 15},
            {"ゾンビイヌ", 15, 15,15, 15, 15, 15, 15},
            {"ひとくいばな", 15, 15,15,15, 15, 15, 15},
            {"やみのきし", 15, 15,15,15, 15, 15, 15},
            {"さつじんき", 15, 15,15,15, 15, 15, 15},
            {"てつのまもり", 15, 15, 15,15, 15, 15, 15},
            {"シークイーン", 15, 15, 15,15, 15, 15, 15},
            {"あくのそっきん", 15, 15,15,15, 15, 15, 15}
        },
        {
            {"タードアーチャー", 15, 15,15,15, 15, 15, 15},
            {"ハニーワスプ",  15, 15,15, 15, 20, 20, 15},
            {"リザードロプス", 15, 15,15, 15, 20, 20, 15},
            {"ゆうれい", 15, 15,15,15, 15, 15, 15},
            {"やみのへいし", 15, 15,15,15, 15, 15, 15},
            {"げんしのかいぶつ", 15,15,15, 15, 15, 15, 15},
            {"ケルベロス", 15, 15,15,15, 15, 15, 15},
            {"シャドードレイク", 15,15,15, 15, 15, 15, 15},
            {"じゃしんかん", 15, 15, 15,15,15, 15, 15},
            {"あくのこんげん", 15, 15, 15,15,15, 15, 15}
        },
        {
            {"はんぎょじん", 15, 15,15,15, 15, 15, 15},
            {"ゴブリン",  15, 15,15, 15, 20, 20, 15},
            {"まほうつかい",  15, 15,15, 15, 20, 20, 15},
            {"へいしのぼうれい", 15, 15,15,15, 15, 15, 15},
            {"めだませいじん", 15, 15,15,15, 15, 15, 15},
            {"うまおばけ", 15, 15,15,15, 15, 15, 15},
            {"きんにくうし", 15, 15,15,15, 15, 15, 15},
            {"わるのたいちょう", 15, 15,15,15, 15, 15, 15},
            {"デビルシャーク", 15, 15, 15,15,15, 15, 15},
            {"まおうのペット", 15, 15,15,15, 15, 15, 15}
        }
    };

public:

    EnemyManager();
    ~EnemyManager();

    CHARACTER_DATA GetEnemyData(int encount_enemy_rank)const;

};